Repository: mymedia2/GroupButler
Catalog: locales/*.po
Languages: ar

source: Go to the message
ar: اذهب إلى الرسالة

source: This command has been removed \[[read more](%s)]
ar: تمت إزالة هذا الأمر \[اقرأ المزيد](%s)]
