Repository: mymedia2/GroupButler
Catalog: locales/*.po
Languages: ar

source: _This group has a log channel saved, but I'm not a member there, so I can't post/retrieve its info_
ar: _هذه المجموعة لديها سجل القناة، ولكن أنا لست عضوا بها، لذلك لا أستطيع نشر/استرداد معلوماتها_

source: <b>This group has a log channel</b> Channel: <code>%s</code>
ar: <b>هذه المجموعة لديها سجل قناة</b> القناة: <code>%s</code>

source: Video messages
ar: رسائل فيديو

source: Warnings | %d | kick
ar: التنبيهات | %d | طرد

source: Warnings | %d | ban
ar: التنبيهات | %d | حظر

source: ❌ warning
ar: ❌ تنبيه

source: 🗑 delete
ar: 🗑 حذف

source: ✅ allowed
ar: ✅ مسموح

source: Tap on a voice in the right to *change the setting* You can use the last lines to change how many warnings should the bot give before kicking/banning/muting someone. The number is not related the the normal `/warn` command. Medias possible statuses: ✅ allowed, ❌ warning, 🗑 delete. When a media is set on delete, the bot will give a warning *only* when the user is at one media from being punished
ar: اضغط على "صوت" الموجود باليمين *لتغيير هذا الإعداد* بإمكانك استخدام السطر الأخير لتغيير عدد مرات التنبيهات التي يرسلها البوت قبل طرد/كتم/حظر المستخدم العدد ليس له علاقة ب الأمر`/warn` حالات الوسائط ✅ مسموحة،❌ إرسال تنبيه، 🗑 حذف. عند وضع الحالة على "حذف"، البوت سوف يرسل تنبيه *فقط* عندما يرسل المستخدم ملف وسائط واحد قبل معاقبته

source: ⚠️ Tap on the right column
ar: ⚠️ اضغط على العمود الأيمن

source: ⚙ The new value is too low ( < 1)
ar: ⚙ القيمة الجديدة صغيرة جدا ( أقل من 1)

source: ⚙ The new value is too high ( > 12)
ar: ⚙ القيمة الجديدة كبيرة جدا (أكبر من 12)

source: 👞 New status is kick
ar: 👞 الحالة الجديدة هي الطرد

source: 👁 New status is mute
ar: 👁 الحالة الجديدة هي الكتم

source: 🔨 New status is ban
ar: 🔨 الحالة الجديدة هي الحظر

source: When enabled, users will be able to report messages with the @admin command
ar: عندما يكون مفعلا، المستخدمين بإمكانهم تبليغ المشرفين بواسطة الأمر @admin

source: Enable or disable the goodbye message. Can't be sent in large groups
ar: تفعيل أو تعطيل الرسالة الوداعية. لا يمكن إرسالها في المجموعات الكبيرة

source: Enable or disable the welcome message
ar: تفعيل أو تعطيل الرسالة الترحيبية

source: When enabled, every time a new welcome message is sent, the previously sent welcome message is removed
ar: عندما يكون مفعلا، كل مرة يتم إرسال رسالة ترحيب جديدة، رسالة الترحيب السابقة سيتم حذفها

source: When enabled, the bot doesn't answer in the group to /dashboard, /config and /help commands (it will just answer in private)
ar: عندما يفعل، البوت لا يجيب في المجموعة على هذه الأوامر/dashboard, /config /help (سوف يجيب عليها في الخاص)

source: Enable and disable the anti-flood system (more info in the /help message)
ar: تفعيل أو تعطيل نظام مكافحة تكرار الرسائل (لمعلومات أكثر تجدها في الأمر /help)

source: If the welcome message is enabled, it will include an inline button that will send to the user the rules in private
ar: عندما يتم تفعيل الرسالة الترحيبية، ستعرض زرا سوف يرسل قوانين المجموعة للعضو على الخاص

source: When someone uses /rules 👥: the bot will answer in the group (always, with admins) 👤: the bot will answer in private
ar: عندما يستخدم أحدهم الأمر /rules 👥: البوت سوف يرسل القوانين على المجموعة (دائما،للمشرفين فقط) 👤: البوت سوف يجيب في الخاص

source: When someone uses an #extra 👥: the bot will answer in the group (always, with admins) 👤: the bot will answer in private
ar: عندما يستخدم أحدهم الأوامر #الإضافية 👥: البوت سوف يرسل القوانين على المجموعة (دائما،للمشرفين فقط) 👤: البوت سوف يجيب في الخاص

source: Select what the bot should do when someone sends a message with arab characters
ar: ماذا تريد أن يفعل البوت حينما يرسل أحدهم رسالة تتضمن أحرفا عربية

source: Bots will be banned when added by normal users
ar: سيتم حظر البوتات عندما يتم إضافتها بواسطة عضو عادي

source: Select what the bot should do when someone sends a message with the RTL character, or has it in his name
ar: ماذا تريد أن يفعل البوت عندما يرسل أحدهم رسالة عربية أو فارسية، أو يتضمن اسمه أحد هذه الأحرف

source: Change how many times an user has to be warned before being kicked/banned
ar: كم عدد التنبيهات التي يرسلها البوت للمستخدم قبل طرده/حظره

source: Change the action to perform when an user reaches the max. number of warnings
ar: غير الاجراء المتبع عندما يصل العضو للحد الأقصى من التنبيهات

source: The new value is too high ( > 12)
ar: القيمة الجديدة عالية جدا (أكبر من 12)

source: The new value is too low ( < 1)
ar: القيمة الجديدة منخفضة جدا (أقل من 1)

source: New action on max number of warns received: ban
ar: إجراء جديد عندما يبلغ المستخدم أقصى عدد من التنبيهات: حظر

source: New action on max number of warns received: mute
ar: إجراء جديد عندما يبلغ المستخدم أقصى عدد من التنبيهات: كتم

source: New action on max number of warns received: kick
ar: إجراء جديد عندما يبلغ المستخدم أقصى عدد من التنبيهات: طرد

source: Action -> kick
ar: إجراء -> طرد

source: Action -> ban
ar: إجراء -> حظر

source: Action -> mute
ar: إجراء -> كتم

source: Allowed ✅
ar: مسموح ✅

source: 🔨 ban
ar: 🔨 حظر

source: Welcome
ar: مرحبا

source: Goodbye
ar: مع السلامة

source: Extra
ar: إضافي

source: Anti-flood
ar: مكافحة التكرار

source: Silent mode
ar: الوضع الصامت

source: Arab
ar: عربي

source: Ban bots
ar: حظر البوتات

source: Reports
ar: إبلاغات

source: Delete last welcome message
ar: حذف رسالة الترحيب الأخيرة

source: Welcome + rules button
ar: الترحيب+ زر القوانين

source: 🔨️ ban
ar: 🔨️ حظر

source: Warns:
ar: التنبيهات:

source: Action:
ar: إجراء:

source: Manage the settings of the group. Click on the left column to get a small hint
ar: تحكم بإعدادات المجموعة. اضغط على العمود الايسر لتحصل على نصيحة

source: %s <b>banned</b> for flood!
ar: %s <b>تم حظره</b> بسبب تكرار الرسائل!

source: %s <b>kicked</b> for flood!
ar: %s <b>تم طرده</b> بسبب تكرار الرسائل!

source: %s <b>muted</b> for flood!
ar: %s <b>تم كتمه</b> بسبب تكرار الرسائل!

source: %s <b>%s</b>: media sent not allowed! ❗️ <code>%d/%d</code>
ar: %s <b>%s</b>:الوسائط المرسلة غير مسموحة! ❗️ <code>%d/%d</code>

source: %s, this type of media is <b>not allowed</b> in this chat. (<code>%d/%d</code>)
ar: %s,هذا النوع من الوسائط<b>غير مسموح به</b>في هذه المحادثة (<code>%d/%d</code>)

source: %s, this type of media is <b>not allowed</b> in this chat. <i>The next time you will be banned/kicked/muted</i>
ar: %s, هذا النوع من الوسائط <b>غير مسموح به</b>في هذه المحادثة. <i>المرة القادمة سوف يتم حظرك/طردك/كتمك</i>

source: %s <b>kicked</b>: RTL character in names/messages are not allowed!
ar: %s <b>تم طرده</b>: الأحرف العربية في الاسم/الرسائل غير مسموحة!

source: %s <b>banned</b>: RTL character in names/messages are not allowed!
ar: %s <b>تم حظره</b>:الأحرف العربية في الاسم/الرسائل غير مسموحة!

source: %s <b>muted</b>: RTL character in names/messages are not allowed!
ar: %s <b>تم كتمه</b>:الأحرف العربية في الاسم/الرسائل غير مسموحة!

source: %s <b>kicked</b>: arab/persian message detected!
ar: %s <b>تم طرده</b>: تم أيجاد رسالة عربية/فارسية!

source: %s <b>banned</b>: arab/persian message detected!
ar: %s <b>تم حظره</b>: تم أيجاد رسالة عربية/فارسية!

source: %s <b>muted</b>: arab/persian message detected!
ar: %s <b>تم كتمه</b>: تم أيجاد رسالة عربية/فارسية!

source: Last message generated by `/pin` ^
ar: الرسالة الأخيرة تم إنشاءها بواسطة`/pin` ^

source: Message edited. Check it here
ar: تم تعديل الرسالة. تحقق منها هنا

source: The old message generated with `/pin` does not exist anymore, so I can't edit it. This is the new message that can be now pinned
ar: الرسال القديمة المنشأة بواسطة `/pin` لم تعد متواجدة، لا يمكنني تعديلها. هذه رسالة جديدة بإمكانك تثبتيها الآن

source: This message can now be pinned. Use `/pin [new text]` to edit it without having to send it again
ar: هذه الرسالة بإمكانك الآن تثبيتها. استخدم الأمر `/pin [اكتب نصك هنا] لتعديلها دون الحاجة لإعادة إرسالها`

source: Channel
ar: قناة

source: Rate me!
ar: قيّمني!

source: 👥 Groups
ar: 👥 المجموعات

source: This bot is based on [otouto](https://github.com/topkecleon/otouto) (AKA @mokubot, channel: @otouto), a multipurpose Lua bot. Group Butler wouldn't exist without it. The owner of this bot is @baconn, do not pm him: use /groups command instead. Bot version: `%s` *Some useful links:*
ar: هذا البوت يعتمد على [otouto] (https://github.com/topkecleon/otouto) (AKA @mokubot, قناة: @otouto) Group Butler لم يكن متواجدا بدونه منشئ البوت هو @baconn لاترسل له رسالة خاصةـ استخدم الأمر /group بدلا عن ذلك. إصدار البوت:%s` *بعض الروابط المساعدة*

source: You can find the list of our support groups in [this channel](%s)
ar: بإمكانك إيجاد قائمة مجموعات الدعم في [هذه القناة](%s)

source: 🔙 back
ar: 🔙 الخلف

source: When you join a group moderated by this bot, you will receive the group rules in private
ar: عندما تدخل مجموعة مدارة بواسطة هذا البوت، ستستلم قوانين المجموعة على الخاص

source: If enabled, you will receive all the messages reported with the @admin command in the groups you are moderating
ar: إذا تم تفعيله، سوف تستلم جميع الرسائل المبلغ عنها باستخدام الأمر @admin في المجموعة التي تديرها

source: Rules on join
ar: القوانين عند الدخول

source: Users reports
ar: بلاغات المستخدمين

source: Change your private settings
ar: غير إعداداتك الخاصة

source: ⚙ Setting applied
ar: ⚙ تم تطبيق الإعداد

source: • <b>Message reported by</b>: %s (<code>%d</code>)
ar: • <b>الرسالة تم التبليغ عنها بواسطة</b>: %s (<code>%d</code>)

source: • <b>Reported message sent by</b>: %s (<code>%d</code>)
ar: • <b>الرسالة المبلغ عنها مرسلة بواسطة</b>: %s (<code>%d</code>)

source: • <b>Group</b>: <a href="%s">%s</a>
ar: • <b>مجموعة</b>: <a href="%s">%s</a>

source: • <b>Group</b>: %s
ar: • <b>مجموعة</b>: %s

source: • <a href="%s">Go to the message</a>
ar: • <a href="%s">اذهب إلى الرسالة</a>

source: • <b>Description</b>: <i>%s</i>
ar: • <b>وصف</b>: <i>%s</i>

source: Address this report
ar: عنوان هذا التقرير

source: _Invalid value:_ number of times allowed (`input: %d`)
ar: _قيمة خاطئة:_ عدد المرات المسموحة (`إدخال: %d`)

source: _Invalid value:_ time (`input: %d`)
ar: _قيمة خاطئة:_ الوقت (`إدخال: %d`)

source: *New parameters saved*. Users will be able to use @admin %d times/%d minutes
ar: *المعلمات الجديدة تم حفظها* المستخدمين بإمكانهم استخدام @admin %d مرات %d دقائق

source: _Please, do not abuse this command. It can be used %d times every %d minutes_. Wait other %d minutes, %d seconds.
ar: _رجاء، لا تسئ استخدام هذا الأمر. بإمكانك استخدامه %d مرات كل %d دقائق_. انتظر عدة %d دقائق، %d ثوان.

source: _Reported to %d admin(s)_
ar: _تم إبلاغها إلى %d مشرف_

source: You closed this issue and deleted all the other reports sent to the admins
ar: لقد أنهيت المشكلة وحذفت جميع البلاغات المرسلة للمشرفين الآخرين

source: This message is too old (>2 days)
ar: هذه الرسالة قديمة جدا (لها أكثر من يومين)

source: ❕ Already (being) adressed
ar: ❕ يجري معالجتها

source: Close issue
ar: أغلق المشكلة

source: %s has/will address this report
ar: %s سيتم/تم معالجة هذا البلاغ

source: This button will delete all the reports sent to the other admins. Tap it again to confirm
ar: هذا الزر سوف يحذف جميع البلاغات المرسلة للمشرفين الآخرين، اضغط مرة أخرى للتأكيد

source: (issue closed by you)
ar: (أغلقت المشكلة بواسطتك)

source: 🚫 Unknown or non-existent group
ar: 🚫 مجموعة غير معروفة أو غير موجودة

source: 🚷 You are not a member of this chat. You can't read the rules of a private group.
ar: 🚷 أنت لست عضوا في هذه المحادثة. لا يمكنك قراءة القوانين الخاصة بمجموعة خاصة.

source: Please write something next `/setrules`
ar: يرجى كتابة نص بعد `/setrules`

source: Rules has been deleted.
ar: تم حذف القوانين.

source: New rules *saved successfully*!
ar: تم حفظ القوانين الجديدة* بنجاح*!

source: _You (user ID: %d) are in the blocked list_
ar: _أنت (ID: %d) متواجد في قائمة المحظورين_

source: _Admin mode is on: only the bot admin can add me to a new group_
ar: _تم تفعيل وضع المشرف: فقط منشئ البوت يمكنه إضافتي إلى مجموعات أخرى_

source: Hello everyone! My name is %s, and I'm a bot made to help administrators in their hard work.
ar: مرحبا بكم! اسمي هو %s، وأنا بوت لمساعدة المشرفين في عملهم الشاق.

source: Yay! This group has been upgraded. You are great! Now I can work properly :)
ar: جيد! هذه المجموعة تم ترقيتها. أنت عظيم! باستطاعتي العمل بشكل صحيح الآن! :)

source: I've been removed from %s [<code>%d</code>], one of your subgroups
ar: تم حذفي من %s [<code>%d</code>], أحد مجموعاتك الخارقة

source: *List of available languages*:
ar: *قائمة اللغات المتاحة*:

source: You are not an admin
ar: أنت لست مشرفاً

source: English language is *set*
ar: اللغة العربية تم *تعيينها*

source: . Please note that translators are volunteers, and some strings of the translation you selected _could not have been translated yet_
ar: . الرجاء العلم بأن جميع المترجمين هم متطوعين، وبعض الكلمات في الترجمة التي اخترتها _لم يتم ترجمتها بعد_

source: can't change the chat title/description/icon
ar: لا يمكنني تغيير عنوان/وصف/أيقونة المحادثة

source: can't send messages
ar: لا استطيع ارسال رسائل

source: can't delete messages
ar: لا استطيع حذف رسائل

source: can't invite users/generate a link
ar: لا استطيع دعوة أشخاص/إنشاء رابط

source: can't restrict members
ar: لا استطيع تقييد الأعضاء

source: can't pin messages
ar: لا أستطيع تثبيت الرسائل

source: can't promote new admins
ar: لا استطيع ترقية مشرفين جدد

source: can't send photos/videos/documents/audios/voice messages/video messages
ar: لا استطيع ارسال صور/فيديوهات/مستندات/صوتيات/رسائل صوتية/رسائل فيديو

source: can't send stickers/GIFs/games/use inline bots
ar: لا استطيع ارسال ملصقات/صور متحركة/ألعاب/بوتات صغيرة

source: can't show link previews
ar: لا استطيع عرض معاينة لصفحة الويب

source: 🔄️ Refresh cache
ar: 🔄️تحديث الذاكرة المخبئية

source: Remove warnings
ar: إزالة التنبيهات

source: *User ID*: `%d` `Warnings`: *%d* `Media warnings`: *%d* `Spam warnings`: *%d*
ar: *عنوان المستخدم*: `%d` `التنبيهات`: *%d* `تنبيهات الوسائط`: *%d* `تنبيهات الإزعاج`: *%d*

source: That user has nothing to do with this chat
ar: هذا المستخدم ليس له علاقة بهذه الدردشة

source: %s is banned from this group
ar: لقد تم حظر %s من المجموعة

source: %s left the group or has been kicked and unbanned
ar: %s غادر المجموعة أو تم طرده وفك حظره

source: %s is an admin
ar: %s هو مشرف

source: %s is the group creator
ar: %s هو منشئ المجموعة

source: %s has nothing to do with this chat
ar: %s ليس لديه علاقة بهذا الدردشة

source: %s is a chat member
ar: %s هو عضو في هذه الدردشة

source: %s is a restricted
ar: %s تم تقييده

source: Restrictions: <i>%s</i>
ar: التقييد: <i>%s</i>

source: Reply to an user or mention them by username or numerical ID
ar: يجب الرد على مستخدم أو نداءه باستخدام اسم المستخدم أو ID

source: I've never seen this user before. This command works by reply, username, user ID or text mention. If you're using it by username and want to teach me who the user is, forward me one of his messages
ar: لم أر هذا المستخدم من قبل هذا الأمر يعمل باستخدام الرد أو النداء بواسطة اسم المستخدم أو الID اذا كنت تستخدمه بواسطة اسم المستخدم وتريد تعليمي من هو هذا الشخص، أعد توجيه إحدى رسائله إلي

source: 📌 Status: `CACHED` ⌛ ️Remaining: `%s` 👥 Admins cached: `%d`
ar: 📌 الحالة: `تم مسح الذاكرة المخبئية` ⌛ ️المتبقي: `%s` 👥 Admins cached: `%d`

source: Message N° %d
ar: الرسالة N° %d

source: You are not allowed to use this button
ar: غير مسموح لك باستخدام هذا الزر

source: The number of warnings received by this user has been <b>reset</b>, by %s
ar: التنبيهات التي تلقاها هذا المستخدم تم <b>محوها</b>، بواسطة %s

source: The adminlist has just been updated. You must wait 10 minutes from the last refresh (wait %d seconds)
ar: قائمة المشرفين تم تحديثها. يجب عليك الانتظار 10 دقائق بعد التحديث السابق (انتظر %d ثوان)

source: ✅ Updated. Next update in %s
ar: ✅ تم التحديث. التحديث القادم في %s

source: Remove warn
ar: إزالة تنبيه

source: Max number of warnings changed (media).
ar: العدد الأقصى للتنبيهات تم تغييره (للوسائط).

source: Max number of warnings changed.
ar: العدد الأقصى للتنبيهات تم تغييره

source: *Old* value was %d *New* max is %d
ar: القيمة *السابقة* كانت%d القيمة *الحالية* هي %d

source: Yes
ar: نعم

source: No
ar: لا

source: Do you want to continue and reset *all* the warnings received by *all* the users of the group?
ar: هل تريد الاستمرار وتصفير *جميع* التنبيهات الخاصة ب*كل* الأعضاء في المجموعة؟

source: Done! %s has been forgiven. <b>Warns found</b>: <i>normal warns %s, for media %s, spamwarns %s</i>
ar: حسنا! %s تم حذف تنبيهاته <b>تنبيهات موجودة</b>: <i> التنبيهات الافتراضية %s، للوسائط %s, إنذارات الازعاج %s, </i>

source: %s <b>%s</b>: reached the max number of warnings (<code>%d/%d</code>)
ar: %s <b>%s</b>: وصل للحد الأقصى من التنبيهات (<code>%d/%d</code>)

source: I can't kick this user. Probably I'm not an Admin, or the user is an Admin iself
ar: لا أستطيع طرد هذا المستخدم إما أنا لست مشرفا ، أو أن هذا المستخدم مشرف بالفعل

source: %s <b>has been warned</b> (<code>%d/%d</code>)
ar: %s <b> تم تنبيهه</b> (<code>%d/%d</code>)

source: The number of warnings received by this user is already <i>zero</i>
ar: التنبيهات التي تلقاها هذا المستخدم هي بالفعل <i>صفر</i>

source: <b>Warn removed!</b> (%d/%d)
ar: <b> تم حذف التنبيه</b> (%d/%d)

source: (Admin: %s)
ar: (المشرف: %s)

source: Done. All the warnings of this group have been erased by %s
ar: حسنا. جميع التنبيهات في هذه المجموعة تم حذفها بواسطة %s

source: _Action aborted_
ar: _تم إيقاف الإجراء_

source: Read the rules
ar: اقرأ القوانين

source: Hi %s!
ar: مرحبا %s!

source: Welcome and...?
ar: مرحباً و...?

source: A form of media has been set as the welcome message: `%s`
ar: أحد الوسائط تم تعيينه كرسالة ترحيبية: `%s`

source: Reply to a `sticker` or a `gif` to set them as the *welcome message*
ar: رد على `ملصق` أو `صورة متحركة` لتعيينهم ك*رسالة ترحيبية*

source: *Custom welcome message saved!*
ar: *تم حفظ رسالة الترحيب!*

source: More info [here](https://telegram.me/GB_tutorials/12)
ar: معلومات أكثر [هنا] (https://telegram.me/GB_tutorials/12)

source: Inline link formatted incorrectly. Check the text between brackets -> \[]() %s
ar: الرابط غير مهيأ بشكل صحيح. تأكد من أن النص داخل الأقواس \[]() %s

source: This text breaks the markdown. More info about a proper use of markdown [here](https://telegram.me/GB_tutorials/10) and [here](https://telegram.me/GB_tutorials/12).
ar: هذا النص يكسر تنسيق ماركداون لمزيد من المعلومات حول الاستخدام السليم لماركداون [هنا](https://telegram.me/GroupButler_ch/46).

source: This message is too long. Max lenght allowed by Telegram: 4000 characters
ar: هذه الرسالة طويلة جدا. أقصى عدد للحروف في تيليجرام هو 4000 حرف

source: One of the URLs that should be placed in an inline button seems to be invalid (not an URL). Please check it
ar: يبدو أن أحد عناوين URL التي يجب وضعها في الزر المتضمن غير صالح (ليس عنوان URL). الرجاء التأكد منه

source: One of the inline buttons you are trying to set is missing the URL
ar: يبدو أن أحد الأزرار المتضمنة التي تحاول ضبطها لا يوجد في عنوان URL

source: One of the inline buttons you are trying to set doesn't have a name
ar: يبدو أن أحد الأزرار المتضمنة التي تحاول ضبطها ليس لها اسم

source: Please input a text
ar: الرجاء إدخال نص

source: Text not valid: unknown formatting error
ar: النص غير صالح: خطأ غير معروف

source: -*empty*-
ar: -*فارغ*-

source: <b>👤 Creator</b> └ %s <b>👥 Admins</b> (%d) %s
ar: <b>👤 المنشئ</b> └ %s <b>👥 المشرفين/ > (%d) %s

source: No commands set
ar: لم يتم ضبط أي أوامر

source: List of custom commands:
ar: قائمة الأوامر المخصصة

source: Current settings for *the group*:
ar: الإعدادات الحالية *للمجموعة*:

source: *Language*: %s
ar: *اللغة*: %s

source: Welcome message
ar: رسالة الترحيب

source: Goodbye message
ar: رسالة الوداع

source: Welcome button
ar: زر الترحيب

source: *Welcome type*: `GIF / sticker`
ar: *نوع الترحيب*: `صورة متحركة/ملصق`

source: *Welcome type*: `custom message`
ar: *نوع الترحيب*: `رسالة مخصصة`

source: *Welcome type*: `default message`
ar: *نوع الترحيب*: `الرسالة الافتراضية

source: Warns (`standard`): *%s*
ar: التنبيهات :*%s*

source: Warns (`media`): *%s*
ar: التنبيهات (`الوسائط`): *%s*

source: ✅ = _enabled / allowed_
ar: ✅ = _مفعل / مسموح_

source: 🚫 = _disabled / not allowed_
ar: 🚫 = _معطل / غير مسموح_

source: 👥 = _sent in group (always for admins)_
ar: 👥 =_يتم إرسالها للمجموعة (دائما للمشرفين)_

source: 👤 = _sent in private_
ar: 👤 = _يتم إرسالها على الخاص_

source: @admin command disabled
ar: الأمر @admin معطل

source: Welcome message won't be displayed from now
ar: لن يتم عرض رسالة الترحيب من الآن

source: Goodbye message won't be displayed from now
ar: لن يتم عرض رسالة التوديع من الآن

source: #extra commands are now available only for moderator
ar: الأوامر #الإضافية الآن متاحة للمسؤولين

source: Anti-flood is now off
ar: مكافح تكرار الرسائل مقفل الآن

source: /rules will reply in private (for users)
ar: /rules سوف يرسل القوانين على الخاص (للأعضاء)

source: Silent mode is now off
ar: الوضع الصامت معطل الآن

source: Links preview disabled
ar: معاينة روابط ويب معطلة الآن

source: Welcome message without a button for the rules
ar: رسالة ترحيبية بدون زر للقوانين

source: @admin command enabled
ar: الأمر @admin مفعل

source: Welcome message will be displayed
ar: سيتم عرض الرسالة الترحيبية

source: Goodbye message will be displayed
ar: سيتم عرض الرسالة الوداعية

source: #extra commands are now available for all
ar: الأوامر #الإضافية متوفرة الآن للكل

source: Anti-flood is now on
ar: مكافح التكرار مفعل الآن

source: /rules will reply in the group (with everyone)
ar: /rules سوف يرد في المجموعة (للكل)

source: Silent mode is now on
ar: الوضع الصامت مفعل الآن

source: Links preview enabled
ar: معاينة روابط ويب مفعلة الآن

source: The welcome message will have a button for the rules
ar: الرسالة الترحيبية ستحتوي زرا خاص لعرض القوانين

source: This setting is enabled, but the goodbye message won't be displayed in large groups, because I can't see service messages about left members
ar: هذا الإعداد مفعل، ولكن رسالة الوداع لن يتم عرضها في المجموعات الكبيرة، لأنه لا يمكنني رؤية رسائل الخدمة الخاصة بمغادرة العضو

source: Start me
ar: ابدأ

source: _Please message me first so I can message you_
ar: _رجاءً أرسل لي رسالة أولاً، حتي يمكنني إرسال رسائل لك._

source: Reply to an user or mention him
ar: رد على شخص ما أو أرسل له نداء

source: Unknown user. Please forward a message from them to me
ar: مستخدم غير معروف الرجاء إعادة توجيه رسالة منه وإرسالها لي

source: <b>Chat</b>: %s [#chat%d]
ar: <b>محادثة</b>: %s [#chat%d]

source: %s • %s • <b>By</b>: %s
ar: %s • %s • <b>بواسطة</b>: %s

source: Get the new photo
ar: الحصول على صورة جديدة

source: %s • %s • <b>By</b>: %s • <i>Reported to %d admin(s)</i>
ar: %s • %s • <b>بواسطة</b>: %s • <i>تم ابلاغ %d مشرف</i>

source: #BLOCKBAN • %s • <b>User</b>: %s [#id%d]
ar: #BLOCKBAN • %s • <b>العضو</b>: %s [#id%d]

source: %s • %s • <b>User</b>: %s
ar: %s • %s • <b>العضو</b>: %s

source: • <b>Added by</b>: %s [#id%d]
ar: • <b>أضيف بواسطة</b>: %s [#id%d]

source: #%s • <b>Admin</b>: %s [#id%d] • %s • <b>User</b>: %s [#id%d] • <b>Count</b>: <code>%d/%d</code>
ar: #%s • <b>المشرف</b>: %s [#id%d] • %s • <b>العضو</b>: %s [#id%d] • <b>العدد</b>: <code>%d/%d</code>

source: <b>Action</b>: <i>%s</i>
ar: <b>إجراء</b>: <i>%s</i>

source: #%s • <b>Admin</b>: %s [#id%s] • %s • <b>User</b>: %s [#id%s] • <b>Warns found</b>: <i>normal: %s, for media: %s, spamwarns: %s</i>
ar: #%s • <b>المشرف</b>: %s [#id%s] • %s • <b>العضو</b>: %s [#id%s] • <b>التنبيهات الموجودة</b>: <i>عادي: %s, وسائط: %s, إزعاج: %s</i>

source: #%s • <b>Admin</b>: %s [#id%s] • %s • <b>Moderator</b>: %s [#id%s]
ar: #%s • <b>المشرف</b>: %s [#id%s] • %s • <b>المسؤول</b>: %s [#id%s]

source: #%s • <b>Admin</b>: %s [#id%s] • %s
ar: #%s • <b>المشرف</b>: %s [#id%s] • %s

source: • <i>Users involved: %d</i>
ar: • <i>الأعضاء المتورطون: %d</i>

source: • <b>User</b>: %s [#id%d]
ar: • <b>العضو</b>: %s [#id%d]

source: #%s • <b>Admin</b>: %s [#id%s] • %s • <b>User</b>: %s [#id%s] • <b>Duration</b>: %d days, %d hours
ar: #%s • <b>المشرف</b>: %s [#id%s] • %s • <b>العضو</b>: %s [#id%s] • <b>المدة</b>: %d أيام, %d ساعات

source: #%s • <b>Admin</b>: %s [#id%s] • %s • <b>User</b>: %s [#id%s]
ar: #%s • <b>المشرف</b>: %s [#id%s] • %s • <b>المستخدم</b>: %s [#id%s]
