Repository: mymedia2/GroupButler
Catalog: locales/*.po
Languages: ar

source: *Welcome/goodbye settings* • `/config`, then `menu` tab: receive in private the menu keyboard. You will find an option to enable/disable welcome/goodbye messages. *Note*: goodbye messages don't work in large groups. This is a Telegram limitation that can't be avoided. *Custom welcome message*: • `/welcome Welcome $name, enjoy the group!` Write after `/welcome` your welcome message. `/goodbye` works in the same way. You can use some placeholders to include the name/username/id of the new member of the group Placeholders: `$username`: _will be replaced with the username_ `$name`: _will be replaced with the name_ `$id`: _will be replaced with the id_ `$title`: _will be replaced with the group title_ `$surname`: _will be replaced by the user's last name_ `$rules`: _will be replaced by a link to the rules of the group. Please read_ [here](https://telegram.me/GroupButler_beta/26) _how to use it, or you will get an error for sure_ *Note*: `$name`, `$surname`, and `$title` may not work properly within markdown markup. *GIF/sticker as welcome message* You can use a particular gif/sticker as welcome message. To set it, reply to the gif/sticker you want to set as welcome message with `/welcome`. Same goes for `/goodbye`
ar: *إعدادات الترحيب/الوداع* •اذهب للأمر `/config` ثم `القائمة الرئيسية`: سوف تستلم لوحة التحكم على الخاص. سوف تجد خيارا لتعطيل/تفعيل رسائل الترحيب/الوداع. *ملاحظة*:رسائل الوداع لا تعمل في المجموعات الكبيرة. هذا الحد من تيليجرام فلذلك لا يمكن تجاوزه. *رسالة ترحيبية مخصصة* • `/welcome Welcome $name, enjoy the group! اكتب رسالتك بعد`/welcome` لحفظها واستخدم نفس الطريقة للأمر `/goodbye` بإمكانك استخدام بعض الأوامر النائبة لإضافة الاسم/اسم المستخدم/عنوان ID للأعضاء الجدد في المجموعة الأوامر النائبة: $username`: _سيتم استبدالها باسم المستخدم_ `$name`: _سيتم استبدالها باسم الشخص_ `$id`: _سيتم استبدالها ب عنوان ID_ `$title`: _سيتم استبدالها بعنوان المجموعة_ `$surname`: _سيتم استبدالها بالاسم الأخير للمستخدم_ `$rules`: _سيتم استبدالها بواسطة رابط لقوانين المجموعة. الرجاء قراءة_ [هذا المقال]https://telegram.me/GroupButler_beta/26) _ لمعرفة كيفية استخدامه وإلا سوف تحصل على رسالة خطأ *ملاحظة*: الأوامر `$name`, `$surname`, وأيضا `$title`من الممكن ألا تعمل بشكل صحيح من خلال تنسيق مارك داون *الصور المتحركة/الملصقات كرسالة ترحيبية* بإمكانك استخدام صورة متحركة/ملصق كرسالة ترحيبية. لتعيينها، قم بالرد على الملصق/الصورة المتحركة باستخدام الأمر `/welcome` للرسائل الترحيبية والأمر `/goodbye`للرسائل الوداعية.

source: *Whitelist settings* As you may know, the bot can warn/kick/ban who sends a telegram.me link (antispam settings) or any other link (media settings). The whitelist is a list of links that will be ignored by the bot. If an user sends a whitelisted link, he won't be warned or kicked. `/whitelist [link(s)]` or `/wl [link(s)]`: add one or more links to the whitelist. `/unwhitelist [link(s)]` or `/unwl [link(s)]`: remove one or more links from the whitelist. `/whitelist` or `/wl`: get the whitelist. `/whitelistl -` or `/wl -`: empty the whitelist. When the group link is saved with `/setlink`, it gets automatically added to the whitelist. *Why links are saved without* _https://_ *and* _www_*?* The bot auto-removes _https://, http:// and www_ from every link to reduce the possibility of having the same link saved twice.
ar: *إعدادات القائمة البيضاء* كما تعلم البوت يستطيع طرد أو حظر أو تنبيه العضو الذي يرسل روابط تيليجرام (إعدادات مكافحة الإزعاج) أو أي رابط آخر (إعدادات الوسائط). القائمة البيضاء هي قائمة بالروابط التي يجب أن يتجاهلها البوت. إذا أرسل أي عضو رابط من القائمة البيضاء فلن يتم تحشره أو طرده. `/whitelist [lالرابط]` or `/wl [lالرابط]`: إضافة واحد أو أكثر من الروابط للقائمة البيضاء. `/unwhitelist [الرابط]` or `/unwl [الرابط]`: إزالة رابط واحد أو أكثر من القائمة البيضاء. `/whitelist` or `/wl`: احصل على القائمة البيضاء. `/whitelistl -` or `/wl -`:تفريع القائمة البيضاء. عندما يتم حفظ رابط المجموعة في الأمر `/setlink` سوف يتم إضافته تلقائيا للقائمة البيضاء *لماذا الروابط تكون محفوظة بدون* https,www ؟ البوت آليا سوف يمسح هذه البادئات من الروابط لتقليل احتمالية حفظ الرابط مرتين

source: *Extra commands* #extra commands are a smart way to save your own custom commands. • `/extra [#trigger] [reply]`: set a reply to be sent when someone writes the trigger. _Example_ : with "`/extra #hello Good morning!`", the bot will reply "Good morning!" each time someone writes #hello. You can reply to a media (_photo, file, vocal, video, gif, audio_) with `/extra #yourtrigger` to save the #extra and receive that media each time you use # command • `/extra list`: get the list of your custom commands. • `/extra del [#trigger]`: delete the trigger and its message. *Note:* the markdown is supported. If the text sent breaks the markdown, the bot will notify that something is wrong. For a correct use of the markdown, check [this post](https://telegram.me/GroupButler_ch/46) in the channel. Now supports placeholders. Check the "welcome" tab for the list of the available placeholders
ar: *الأوامر الإضافية* الأوامر #الإضافية طريقة ذكية لحفظ أوامرك المخصصة • `/extra [#trigger] [reply]`: لضبط إجابة ترسل عندما يكتب أحدهم كلمة. _مثال_ "`/extra #مرحبا صباح الخير! البوت سيرد ب"صباح الخير" عندما يكتب أحدهم "مرحبا" بإمكانك الرد على وسائط (_صورة، ملف، رسالة صوتية، فيديو، صورة متحركة، صوت_) باستخدام `/extra #النص الخاص بك` واستلام هذه الوسائط عندما تستخدم النص الخاص بك • `/extra list`: للحصول على قائمة الأوامر المخصصة • `/extra del [#الأمر]`: حذف هذا الأمر والرد عليه *ملاحظة* : تنسيق مارك داون مدعوم ، إذا تم كسر التنسيق، سيشعرك البوت بأن هنالك خطأ ما للاستخدام الصحيح لتنسيق مارك داون ادخل [هذه المقالة] ](https://telegram.me/GroupButler_ch/46) الآن يدعم الأوامر النائبة، لمعرفة طريقة استخدامها ادخل تبويب الرسائل الترحيبية

source: *Warns* Warn are made to keep the count of the admonitions received by an user. Once an user has been warned for the defined number of times, he is kicked/banned by the bot. There are two different type of warns: - _normal warns_, given by an admin with the `/warn` command - _automatic warns_ (read: media warns and spam warns), given by the bot when someone sends a media that is not allowed in the chat, or spams other channels or telegram.me links. • `/warn [by reply]`: warn a user • `/sw`: you can place a `/sw` (_"silent warn"_) everywhere you want in your message. The bot will silently count the warn, but won't answer in the group unless the user reached the max. number of warnings. • `/nowarns [by reply]`: reset the warns received by an user (both normal and automatic warns). • `/warnmax [number]`: set the max number of the warns before the kick/ban. • `/warnmax media [number]`: set the max number of the warns before kick/ban when an unallowed media is sent. How to see how many warns a user has received (or to reset them): `/user` command. How to change the max. number of warnings allowed: `/config` command, then `menu` button. How to change the max. number of warnings allowed for medias: `/config` command, then `media` button. How to change the max. number of warnings allowed for spam: `/config` command, then `antispam` button.
ar: *التنبيهات* التنبيه يستخدم في تحذير المستخدم عن مخالفة ما. عندما يتم تحذير العضو للحد الأقصى من التنبيهات سوف يطرد/يحظر بواسطة البوت هناك نوعان من التنبيهات: -_التنبيه العادي_ بواسطة المشرف من خلال الأمر `/warn` -_التنبيه الأوتوماتيكي_- بواسطة البوت عندما يرسل أحد الأعضاء ملف وسائط غير مسموح به في المجموعة • `/warn [بواسطة الرد]`: لتنبيه مستخدم • `/sw`: بإمكانك إرسال `/sw` (_"التنبيه الصامت"_) في أي مكان في رسالتك. البوت سوف يحسب هذا التنبيه ولكن بشكل صامت، ماعدا عندما يبلغ المستخدم الحد الأقصى من التنبيهات • `/nowarns [بواسطة الرد]`: سوف يمحو جميع التنبيهات التي على هذا العضو • `/warnmax [عدد]`: لتعيين العدد الأقصى من التنبيهات قبل الطرد أو الحظر. • `/warnmax media [عدد]`: لتعيين العدد الأقصى من التنبيهات قبل الطرد أو الحظر للوسائط المخالفة. لرؤية عدد التنبيهات أو لمحوها استخدم الأمر `/user` لتغيير عدد التنبيهات قبل الطرد استخدم الأمر `/config` ومن ثم اذهب إلى القسم الذي تريد تعديل عدد انذاراته

source: *Pinning messages* The "48 hours limit" to edit your own messages doesn't apply to bots. This command was born from the necessity of editing the pinned message without sending it again, maybe just to change few things. So with `/pin` you can generate a message to pin, and edit it how many times you want. • `/pin [text]`: the bot will send you back the text you used as argument, with markdown. You can pin the message and use `/pin [text]` again to edit it • `/pin`: the bot will find the latest message generate by `/pin`, if it still exists • `/newpin [text]`: forces the bot to send another message that will be saved as new target for `/pin` *Note*: `/pin` supports markdown, but only `$rules` and `$title` placeholders
ar: *تثبيت الرسائل* حد "48ساعة" لتعديل رسالتك لا ينطبق على البوتات هذا الأمر تم إنشاءه لضرورة تعديل الرسالة المثبتة دون الحاجة إلى إعادة إرسالها، من الممكن أن يستخدم لتعديل بعض الأشياء باستخدام الأمر`/pin بإمكانك إنشاء رسالة ليتم تثبيتها وبإمكانك تعديلها بحرية. • `/pin [نص]`: البوت سوف يعيد لك إرسال النص باستخدام تنسيق مارك داون. بإمكانك تثبيت الرسالة واستخدام الأمر`/pin [text]` مرة أخرى لتعديلها • `/pin`: البوت سوف يجد الرسالة الأخيرة الموجود في الأمر `/pin`, إذا كانت لاتزال موجودة • `/newpin [text]`:تجبر البون على إرسال رسالة أخرى لتكون هدفا للأمر`/pin` *ملاحظة* : الأمر `/pin` يدعم تنسيق مارك داون ولكن فقط هذه الأوامر النائبة `$rules` و `$title`

source: *Group language*" • `/lang`: choose the group language (can be changed in private too). *Note*: translators are volunteers, so I can't ensure the correctness of all the translations. And I can't force them to translate the new strings after each update (not translated strings are in english). Anyway, translations are open to everyone. If you want to translate the bot, see an [information](https://github.com/RememberTheAir/GroupButler#translators) on GitHub. Ask in the English /group for the `.po` file of your language. *Special characters* • `/config` command, then `menu` button: you will receive in private the menu keyboard. Here you will find two particular options: _Arab and RTL_. *Arab*: when Arab it's not allowed (🚫), everyone who will write an arab character will be kicked from the group. *Rtl*: it stands for 'Righ To Left' character, and it's the responsible of the weird service messages that are written in the opposite sense. When Rtl is not allowed (🚫), everyone that writes this character (or that has it in his name) will be kicked.
ar: *لغة المجموعة*" • `/lang`: لاختيار لغة المجموعة (بالإمكان تغييرها من الرسائل الخاصة أيضا) *ملاحظة* : المترجمين هم متطوعون، لذلك لايمكنني التأكد من صحة الترجمات. كما لايمكنني إجبارهم على ترجمة الكلمات الجديدة بعد كل تحديث (الكلمات الغير مترجمة سوف تكون باللغة الإنجليزية). على كل الترجمة مفتوحة للجميع إذا أردت ترجمة البوت، انظر إلى [معلومات](https://github.com/RememberTheAir/GroupButler#translators)على GitHub. اسأل في المجموعة الإنجليزية /group عن ملف `.po` الخاص بلغتك. *أحرف خاصة* • `/config` استخدم هذا الأمر ثم القائمة الرئيسية سوف يصلك على الخاص لوحة تحكم هنا سوف تجد خيارين لمنع _ اللغة العربية أو منع لغات اليمين لليسار_ *العربية*: عندما يتم حظر اللغة العربية(🚫) أي شخص يكتب باللغة العربية سيتم طرده من المجموعة *اليمين لليسار: سيتم حظر كل من يكتب لغات اليمين لليسار (🚫)مثل الفارسي والعربي، قد يفيد الخيار في تخفيف البوتات الغريبة.

source: *General group settings* `/config` or `/settings`: manage the group settings in private from an inline keyboard. The inline keyboard has six sub-menus: *Menu*: manage the most important group settings *Antiflood*: turn on or off the antiflood, set its sensitivity and choose some media to ignore, if you want *Media*: choose which media to forbid in your group, and set the number of times that an user will be warned before being kicked/banned *Antispam*: choose which kind of spam you want to forbid (example: telegram.me links, forwarded messages from channels) *Log channel*: choose which updates should be logged *Moderators*: promote or demote moderators *Bonus commands*: `/reportflood [number of messages]/[timeframe]`: set how many times users can use the @admin command within a certain timeframe. `/leave`: the bot will leave the group without deleting its data. Use this command only if you are going to add the bot to the group again `/snap`: generate a backup file that can be restored with `/import` (send the file in the group and reply to it). `/snap` can be used once every three days
ar: *الإعدادات العامة للمجموعة* الأمر `/config` أو`/settings`: لإدارة المجموعة من خلال لوحة تحكم صغيرة ترسل على الخاص. اللوحة الصغيرة تحتوي على 6 قوائم صغيرة: *الرئيسية*: تغيير الإعدادات المهمة في المجموعة *مكافح التكرار*: تشغيل أو إيقاف مكافح التكرار وضبط حساسيته، واختيار بعض الوسائط المراد تجاهلها، إذا أردت *وسائط*: اختر أي نوع من الوسائط تريد منعه في المجموعة، وكم عدد الإنذارات التي تريد أن يرسلها البوت قبل طرد المستخدم أو حظره *مضاد الإزعاج*:اختر أي نوع من الإزعاج تريد منعه في المجموعة (مثل روابط تيليجرام أو الرسائل المعاد توجيهها من القنوات) *سجل القناة*: ماهي التحديثات التي تريد منه تدوينها في السجل *المسؤولين* رفع رتبة أو تخفيض المسؤولين *أوامر أخرى* `/reportflood [عدد الرسائل]/[الإطار الزمني]`: لضبط كم مرة تريد من الأعضاء تبليغ المشرفين عن الرسائل خلال إطار زمني معين. `/leave`: البوت سوف يخرج من المجموعة من دون حذف بياناتها، استخدم هذا الأمر في حال أردت إضافة البوت للمجموعة مرة أخرى `/snap`:لإنشاء ملف نسخة احتياطية بالإمكان استعادته بواسطة الأمر`/import`(ارسل الملف للمجموعة ثم قم بالرد عليه). هذا الأمر بإمكانك استخدامه مرة واحدة كل ثلاث أيام.

source: *Moderators* Moderators are normal users that can use some of the commands that are usually available only to the group administrators. By default, moderators only have the banhammer (they can use _/ban, /kick, /unban, /tempban, /warn, /nowarn, /block, /unblock, /user_). But their powers can be expanded or restricted by the administrators: there is a button in the /config menu, called _"Moderators"_, where the permissions of the moderators can be configured. By default, every admin can promote a new moderator, or demote an user who is already a mod. If you are the group owner, in the _"Moderators"_ section of the configuration menu you will be able to find a switch called _"Admins can manage mods"_. When disabled, the group administrators *can't promote or demote new moderators*, and also they won't be allowed to access the _"Moderators"_ section of the configuration menu (so they *won't be able to change the moderators permissions*). *Commands* `/promote [by reply|by username|by text mention|by ID]`: promote an user to moderator. If used on a moderator, it will update his name in the moderators list. `/demote [by reply|by username|by text mention|by ID]`: demote an moderator. `/modlist`: show the list of the moderators `/modlist -`: demote all the moderators (will clean the modlist)
ar: *المسؤولين* المسؤولين هم أعضاء عاديون ولكن بإمكانهم استخدام أوامر متاحة فقط للمشرفين افتراضيا المسؤولين لديهم فقط مطرقة الحظر (بإمكانهم استخدام الأوامر _/ban, /kick, /unban, /tempban, /warn, /nowarn, /block, /unblock, /user_). ولكن بالإمكان زيادة أو تخفيض قدراتهم بواسطة المشرفين: من خلال الأمر /config ثم خيار _المسؤولين_ افتراضيا، كل مشرف بإمكانه ترقية مسؤولين جدد، أو تخفيض أي مسؤول. إذا كنت منشئ المجموعة بإمكانك رؤية الإعدادات من القسم _"المسؤولين"_ من خلال قائمة التكوين /config، ثم تعديل خيار "_المشرفين بإمكانهم التحكم بالمسؤولين_" عندما يكون معطلا، مشرفي المجموعة *لن يستطيعون ترقية أو تخفيض أي مسؤول"، أيضا لن يسمح لهم بالدخول على قسم _"المسؤولين"_ من خلال قائمة التكوين. *الأوامر* `/promote [بواسطة الرد|اسم المستخدم|نداء|عنوان ID]`: لترقية عضو إلى مسؤول، إذا تم استخدام الأمر على مسؤول فسوف يعرض اسمه في قائمة المسؤولين. `/demote [بواسطة الرد|اسم المستخدم|نداء|عنوان ID]`:لتخفيض رتبة مسؤول `/modlist`: لعرض قائمة تتضمن أسماء جميع المسؤولين `/modlist -`: تخفيض جميع المسؤولين (سيتم حذف قائمة المسؤولين)

source: *Log channel informations* A log channel is a _(private)_ channel where the bot will record all the important events that will happen in your group. If you want to use this feature, you need to pair your group with a channel with the commands described below. All the events, by default, are *not logged*. Admins can choose which events to log from the `/config` menu -> `log channel` button. To pair a channel with a group, the *channel creator* must [add the bot to the channel administrators](telegram.me/gb_tutorials/4) (otherwise it won't be able to post), and send in the channel this command: `/setlog` Then, an admin of the group must forward in the group the message ("`/setlog`") sent in the channel. *Done*! (you can find a video-tutorial [here](https://telegram.me/GB_tutorials/8)) A channel can be used as log by different groups. To change your log channel, simply repeat this process with another channel. `/unsetlog`: remove your current log channel `/logchannel`: get some informations about your log channel, if paired
ar: *معلومات سجل القناة* سجل القناة هو قناة _(خاصة)_ يسجل فيها البوت جميع الأحداث التي حصلت في المجموعة إذا أردت استخدام هذه الخاصية، يجب عليك إقران مجموعتك بقناة باستخدام الأوامر التي بالأسفل جميع الأحداث لا* يتم تسجيلها *افتراضيا. المشرفين بإمكانهم تحديد الأحداق التي يجب تسجيلها من خلال أمر `/config` ومن ثم اختيار القائمة الرئيسية -> سجل القناة لإقران قناة بالمجموعة يجب على *منشئ القناة* [إضافة البوت وجعله مشرف](telegram.me/gb_tutorials/4) (وإلا لن يكون باستطاعته النشر)، ثم استخدام الأمر التالي: `/setlog ثم أحد مشرفي المجموعة يجب أن يعيد توجيه رسالة ("`/setlog`") التي في القناة إلى المجموعة. *تم* بإمكانك إيجاد فيديو [باللغة الإنجليزية] [هنا]](https://telegram.me/GB_tutorials/8)) القناة يمكن استخدامها كسجل لأكثر من مجموعة. لتغيير القناة التي تسجل فقط أعد الخطوات الموضحة بالأعلى على القناة الجديدة `/unsetlog`: لإزالة سجل القناة الحالي `/logchannel`: احصل على بعض المعلومات الخاصة بسجل قناتك، إذا كانت مقترنة

source: Banhammer
ar: مطرقة الحظر

source: Group info
ar: معلومات المجموعة

source: Report system
ar: نظام التبليغات

source: Pin
ar: تثبيت

source: Languages
ar: اللغات

source: Group configuration
ar: تكوين المجموعة

source: Warns
ar: التنبيهات

source: Welcome settings
ar: إعدادات الترحيب

source: Links whitelist
ar: روابط القائمة البيضاء

source: 📢 Bot channel
ar: 📢 قناة البوت

source: 🌍 Select your language
ar: 🌍 اختر لغتك

source: 📕 All the commands
ar: 📕 جميع الأوامر

source: Basics
ar: أساسيات

source: Admin commands
ar: أوامر المشرفين

source: Normal users commands
ar: أوامر المستخدمين

source: Commands in private
ar: الأوامر في الخاص

source: Log channel
ar: سجل القناة

source: Back
ar: الخلف

source: [Start me](%s) _to get the list of commands_
ar: [Start me](%s) _لتحصل على قائمة الأوامر_

source: Main menu
ar: القائمة الرئيسية

source: Basic usage
ar: أساسيات الاستخدام

source: Commands for users (group)
ar: أوامر المستخدمين (مجموعة)

source: Available commands in private
ar: الأوامر المتاحة في الخاص

source: Available commands in a realm
ar: الأوامر المتاحة في الحقل

source: Log channel informations
ar: معلومات سجل القناة

source: Informations about the moderators
ar: معلومات عن المسؤولين

source: Available commands for admins
ar: الأوامر المتاحة للمشرفين

source: Deprecated message, send /help again
ar: رسالة موقوفة، ارسل /help مرة أخرى

source: ❗️ Already there
ar: ❗️بالفعل هناك

source: *No link* for this group. Ask the owner to save it with `/setlink [group link]`
ar: *لا يوجد رابط* لهذه المجموعة. اسأل منشئ المجموعة لوضعه في أمر /setlink

source: Link *unset*
ar: الرابط *غير مضبوط*

source: The link has been set. *Here's the link*: %s
ar: تم تعيين الرابط. *وهو الآن*: %s

source: This is not a *public supergroup*, so you need to write the link near `/setlink`
ar: هذه المجموعة ليست *مجموعة خارقة عامة*، إذا عليك كتابة الرابط بجوار `/setlink`

source: This link is *not valid!*
ar: هذا الرابط *غير صحيح!*

source: The link has been updated. *Here's the new link*: %s
ar: تم تحديث الرابط، *وهو الآن* :%s

source: Log every time an user join the group
ar: سجّل كل مرة يدخل فيها عضو للمجموعة

source: Bans will be logged. I can't log manual bans
ar: سيتم تسجيل الحظر. لا يمكنني تسجيل الحظر اليدوي

source: Kicks will be logged. I can't log manual kicks
ar: سيتم تسجيل الطرد. لا يمكنني تسجيل الطرد اليدوي

source: Manual warns will be logged
ar: التنبيهات اليدوية سيتم تسجيلها

source: Forbidden media will be logged in the channel
ar: الوسائط الممنوعة سيتم تسجيلها في القناة

source: Spam links/forwards from channels will be logged in the channel, only if forbidden
ar: الروابط/إعادات التوجيه المزعجة من القنوات سيتم تسجيلها في القناة، فقط إذا كانت ممنوعة

source: Log when an user is flooding (new log message every 5 flood messages)
ar: سجّل عندما يكرر مستخدم ما رسائله (رسالة جديدة بالسجل كل 5 رسائل مكررة)

source: Log when an admin changes the group icon
ar: سجّل عندما يغير المشرف صورة عرض المجموعة

source: Log when an admin deletes the group icon
ar: سجل عندما يحذف المشرف صورة عرض المجموعة

source: Log when an admin change the group title
ar: سجّل عندما يغير المشرف اسم المجموعة

source: Log pinned messages
ar: سجّل الرسائل المثبتة

source: Log when an user who has been blocked is banned from the group (when he join)
ar: سجّل عندما يتم طرد العضو المحظور (عندما يدخل)

source: Log when a new user is promoted to moderator
ar: سجّل عندما يتم ترقية أحد الأعضاء إلى مسؤول

source: Log when an user looses the role of moderator
ar: سجّل عندما يتم تخفيض رتبة أحد المسؤولين إلى عضو

source: Log when someone demotes all the moderators with '/modlist -'
ar: سجّل عندما يخفض أحد ما المسؤولين بأمر '/modlist -'

source: Log when an admin removes the warning received by an user
ar: سجّل عندما يمسح أحد المشرفين الإنذارات الخاصة بعضو

source: Log when an user reports a message with the @admin command
ar: سجّل عندما يبلغ أحد الأعضاء باستخدام الأمر @admin

source: Ban
ar: حظر

source: Kick
ar: طرد

source: Unban
ar: فك حظر

source: Tempban
ar: حظر مؤقت

source: Report
ar: إبلاغ

source: Warns resets
ar: محو الإنذارات

source: New members
ar: أعضاء جدد

source: Media warns
ar: تنبيه على الوسائط

source: Spam warns
ar: تنبيه على الإزعاج

source: Flood
ar: تكرار الرسائل

source: Promotions
ar: الترقيات

source: Demotions
ar: التخفيضات

source: All mods demoted
ar: تم تخفيض جميع المسؤولين

source: New group icon
ar: صورة جديدة للمجموعة

source: Group icon removed
ar: تم إزالة صورة المجموعة

source: New group title
ar: اسم جديد للمجموعة

source: Pinned messages
ar: رسالة مثبتة

source: Users blocked and banned
ar: الأعضاء المحظورين والمطرودين

source: Users blocked
ar: تم حظر المستخدمين

source: Users unblocked
ar: تم فك حظر المستخدمين

source: You are not admin of this group
ar: إنت لست مشرفاً

source: User unbanned!
ar: تم فك حظر المستخدم!

source: *Select the events the will be logged in the channel* ✅ = will be logged ☑️ = won't be logged Tap on a voice to get further informations
ar: *اختر الأحداث التي تريد تسجيلها/تدوينها في القناة* ✅ = سيتم تسجيلها ☑️ = لن يتم تسجيلها اضغط على الصوت للحصول على معلومات إضافية

source: _Too many requests. Retry later_
ar: _طلبات كثيرة جدا. حاول مرة أخرى لاحقا_

source: _I need to be admin in the channel_
ar: _يجب أن أكون مشرفا في القناة_

source: _Already using this channel_
ar: _استخدم هذه القناة مسبقا_

source: *Log channel added!*
ar: *تمت إضافة سجل القناة*

source: <i>%s</i> changed its log channel
ar: <i>%s</i> تم تغيير سجل القناة

source: Logs of <i>%s</i> will be posted here
ar: سجلات <i>%s</i> سيتم نشرها هنا

source: _Only the channel creator can pair the chat with a channel_
ar: _فقط منشئ القناة بإمكانه إقران المحادثة مع القناة_

source: _I'm sorry, only private channels are supported for now_
ar: _اعتذر، فقط القنوات الخاصة مدعومة الآن_

source: You have to *forward* the message from the channel
ar: يجب أن *تعيد توجيه* هذه الرسالة من القناة

source: _This groups is not using a log channel_
ar: _هذه المجموعة لا تستخدم سجل القناة_

source: *Log channel removed*
ar: *تم إزالة سجل القناة*
