Repository: mymedia2/GroupButler
Catalog: locales/*.po
Languages: ar

source: 🐞 Sorry, a *bug* occurred
ar: 🐞 نعتذر، حدث *خطأ* ما

source: Hello everyone! My name is %s, and I'm a bot made to help administrators in their hard work. Unfortunately I can't work in normal groups. If you need me, please ask the creator to convert this group to a supergroup and then add me again.
ar: مرحبا بك! اسمي هو %s، وأنا بوت لمساعدة المشرفين في عملهم الشاق. للأسف، لا يمكنني العمل في المجموعات العادية. إذا احتجتني، اسأل منشئ المجموعة لتحويلها إلى مجموعة خارقة ثم أضفني مرة أخرى.

source: I don't have enough permissions to restrict users
ar: ليست لدي الصلاحيات الكافية لتقييد المستخدمين

source: I'm not an admin, I can't kick people
ar: أنا لست مشرفا، لا يمكنني طرد الأعضاء

source: I can't kick or ban an admin
ar: لا يمكنني طرد أو حظر مشرف

source: There is no need to unban in a normal group
ar: ليس هناك حاجة لفك الحظر في المجموعات العادية

source: This user is not a chat member
ar: هذا المستخدم ليس عضوا في هذه المحادثة

source: banned
ar: محظور

source: kicked
ar: مطرود

source: muted
ar: مكتوم

source: telegram.me links
ar: روابط تيليجرام

source: Channels messages
ar: رسائل القنوات

source: %s %s for <b>spam</b>! (%d/%d)
ar: %s %s بسبب <b>إزعاج</b>! (%d/%d)

source: %s, spam is not allowed here. The next time you will be restricted
ar: %s، الإزعاج غير مسموح هنا. المرة القادمة سيتم تقييدك

source: %s, this kind of spam is not allowed in this chat (<b>%d/%d</b>)
ar: %s, هذا النوع من الإزعاج غير مسموح به هنا (<b>%d/%d</b>)

source: telegram.me link
ar: روابط تيليجرام

source: message from a channel
ar: رسالة من قناة

source: forwards are allowed
ar: السماح بإعادة التوجيه

source: warn for forwards
ar: التنبيه عند إعادة التوجيه

source: forwards will be deleted
ar: سيتم حذف الرسائل المعاد توجيهها

source: links are allowed
ar: السماح بالروابط

source: warn for links
ar: التنبيه عند إرسال روابط

source: links will be deleted
ar: سيتم حذف الروابط

source: You can't go lower
ar: لا يمكن الذهاب للأسفل

source: You can't go higher
ar: لا يمكن الذهاب للأعلى

source: New value: %d
ar: القيمة الجديدة: %d

source: Allow/forbid telegram.me links
ar: اسمح/امنع روابط تيليجرام

source: Allow/forbid forwarded messages from channels
ar: اسمح/امنع الرسائل المعادة توجيهها من القنوات

source: Set how many times the bot should warn the user before kick/ban him
ar: كم مرة تريد من البوت تنبيه المستخدم قبل طرده/حظره

source: Description not available
ar: الوصف غير متاح

source: Kick 👞
ar: طرد 👞

source: Ban 🔨
ar: حظر 🔨

source: Mute 👁
ar: كتم 👁

source: You're no longer an admin
ar: أنت لم تعد مشرفا

source: *Anti-spam settings* Choose which kind of spam you want to forbid • ✅ = *Allowed* • ❌ = *Not allowed* • 🗑 = *Delete* (doesn't warn, kick or ban. Just deletes)
ar: *أعدادات منع الإزعاج* اختر أي أنواع الإزعاج تريد منعه • ✅ = *مسموح* • ❌ = *ممنوع* • 🗑 = *حذف* (لايرسل تنبيهات، ولا يحظر أو يطرد. فقط يحذف)

source: _The whitelist was already empty_
ar: _القائمة البيضاء فارغة بالفعل_

source: *Whitelist cleaned* %d links have been removed
ar: *تم تنظيف القائمة البيضاء* %d رابط تم حذفه

source: _I can't find any url in this message_
ar: _لا يمكنني إيجاد أي رابط في هذه الرسالة_

source: %d link(s) will be whitelisted
ar: %d رابط ستتم إضافته للقائمة البيضاء

source: %d links were already in the list
ar: %d روابط مضافة مسبقا للقائمة

source: _The whitelist is empty_. Use `/wl [links]` to add some links to the whitelist
ar: _القائمة البيضاء فارغة_. استخدم الأمر `/wl [links]` لإضافة الروابط للقائمة البيضاء

source: Whitelisted links:
ar: روابط القائمة البيضاء:n\

source: %d link(s) removed from the whitelist
ar: %d روابط محذوفة من القائمة البيضاء

source: _Whitelist of channels empty_
ar: _القائمة البيضاء الخاصة بالقنوات فارغة_

source: *Whitelisted channels:* %s
ar: *القنوات في القائمة البيضاء:* %s

source: _I can't find a channel ID in your message_
ar: _لا يمكنني إيجاد عنوان القناة في رسالتك_

source: <i>I'm sorry, this command has been used for the last time less then 3 hours ago by</i> %s (ask him for the file). Wait [<code>%s</code>] to use it again
ar: <i>اعتذر، هذا الأمر تم استخدامه المرة الأخيرة خلال أٌقل من 3 ساعات بواسطة</i>%s(اسأله عن الملف). انتظر [<code>%s</code>] لاستخدامه مرة أخرى

source: *Sent in private*
ar: *تم إرساله على الخاص*

source: Download of the file failed with code %s
ar: لقد فشل تحميل الملف خطأ %s

source: Chat IDs don't match (%s and %s)
ar: عناوين ID للمحادثة لا تتطابق (%s and %s)

source: This is not a valid backup file. Reason: invalid name (%s)
ar: ملف النسخة الاحتياطية هذا غير صالح السبب: اسم خاطئ (%s)

source: Invalid input. Please reply to a document
ar: إدخال خاطئ. الرجاء الرد على مستند

source: Invalid input. Please reply to the backup file (/snap command to get it)
ar: إدخال خاطئ. يجب الرد على ملف نسخة احتياطية استخدم الأمر (/snap)

source: Use -/+ to edit the value, then select a timeframe to temporary ban the user
ar: اضغط على أزرار - / + لتغيير هذه القيمة. ثم حدد إطارا زمنيا لتنفيذ الحظر

source: I can't kick this user. Either I'm not an admin, or the targeted user is!
ar: لا أستطيع طرد هذا المستخدم أنا لست مشرفا أو أن هذا المستخدم مشرف بالفعل!

source: %s kicked %s!
ar: %s مطرود %s!

source: %s banned %s!
ar: %s محظور %s!

source: _Use this command in reply to a forwarded message_
ar: _استخدم هذا الأمر في الرد على رسالة معاد توجيهها_

source: I can't kick this user. I am not allowed to ban or the target user is an admin
ar: لا أستطيع طرد هذا المستخدم لم يسمح لي بالحظر أو أن هذا المستخدم مشرف بالفعل

source: _An admin can't be unbanned_
ar: _المشرف لا يمكن أن يفك حظره_

source: %s unbanned by %s!
ar: %s تم فك حظره بواسطة%s!

source: You don't have the permissions to restrict members
ar: ليس لديك الصلاحية لتقييد مستخدم

source: Tap on the -/+ buttons to change this value. Then select a timeframe to execute the ban
ar: اضغط على أزرار - / + لتغيير هذه القيمة. ثم حدد إطارا زمنيا لتنفيذ الحظر

source: You can't set a lower value
ar: لا تستطيع ضبط قيمة أقل

source: Stop!!!
ar: توقف!!!

source: hours
ar: ساعات

source: days
ar: أيام

source: minutes
ar: دقائق

source: User banned for %d %s
ar: تم حظر المستخدم بسبب %d %s

source: 🛠 Menu
ar: 🛠 الرئيسية

source: ⚡️ Antiflood
ar: مكافحة التكرار

source: 🌈 Media
ar: 🌈 وسائط

source: 🚫 Antispam
ar: 🚫 مكافحة الإزعاج

source: 📥 Log channel
ar: 📥 سجل القناة

source: ⛔️ Default permissions
ar: ⛔️ الصلاحيات الافتراضية

source: <b>%s</b> <i>Change the settings of your group</i>
ar: <b>%s</b> <i>غير إعدادات مجموعتك</i>

source: _I've sent you the keyboard via private message_
ar: _لقد أرسلت لك لوحة التحكم على الخاص_

source: <i>Change the settings of your group</i>
ar: <i>غير إعدادات مجموعتك</i>

source: ✅ | ON
ar: ✅ | تشغيل

source: ❌ | OFF
ar: ❌ | إيقاف

source: 👞 kick
ar: 👞 طرد

source: 🔨️ ️ban
ar: 🔨 حظر

source: 👁 mute
ar: 👁 كتم

source: Texts
ar: نصوص

source: Forwards
ar: إعادة توجيه

source: Stickers
ar: ملصقات

source: Images
ar: صور

source: GIFs
ar: صور متحركة

source: Videos
ar: فيديوهات

source: - *Status*: `%s`
ar: - *حالات: `%s`

source: - *Action* to perform when an user floods: `%s`
ar: - *Action* لاتخاذ إجراء عندما يكرر المستخدم رسالته `%s`

source: - Number of messages allowed *every 5 seconds*: `%d`
ar: -عدد الرسائل المسموحة *خلال 5 ثوان*: `%d`

source: - *Ignored media*: %s
ar: - *الوسائط المتجاهلة*: %s

source: Settings
ar: الإعدادات

source: Admins
ar: المشرفين

source: Rules
ar: قوانين

source: Extra commands
ar: أوامر إضافية

source: Flood settings
ar: إعدادات التكرار

source: Media settings
ar: إعدادات الوسائط

source: Navigate this message to see *all the info* about this group!
ar: حرك هذه الرسالة لرؤية *جميع المعلومات* عن هذه المجموعة

source: _I've sent you the group dashboard via private message_
ar: _لقد أرسلت لك لوحة القيادة الخاصة بالمجموعة على الخاص_

source: 🚫 This group does not exist
ar: 🚫 هذه المجموعة غير موجودة أصلا

source: 🚷 You are not a member of the chat. You can't see the settings of a private group.
ar: 🚷 أنت لست عضوا في هذه المحادثة. لايمكنك رؤية الإعدادات الخاصة بمجموعة خاصة

source: ℹ️ Group ► Settings
ar: ℹ️مجموعة ◄ إعدادات

source: ℹ️ Group ► Rules
ar: ℹ️مجموعة ◄ قوانين

source: I got kicked out of this group 😓
ar: لقد تم طردي من هذه المجموعة 😓

source: ℹ️ Group ► Admin list
ar: ℹ️مجموعة ◄ قائمة المشرفين

source: ℹ️ Group ► Extra
ar: ℹ️مجموعة ◄ إضافي

source: ℹ️ Group ► Flood
ar: ℹ️مجموعة ◄ تكرار الرسائل

source: Documents
ar: مستندات

source: Vocal messages
ar: رسائل صوتية

source: Links
ar: روابط

source: Music
ar: صوتيات

source: Contacts
ar: جهات اتصال

source: Games
ar: ألعاب

source: Locations
ar: مواقع

source: *Current media settings*:
ar: *الإعدادات الحالية للوسائط*:

source: ℹ️ Group ► Media
ar: ℹ️مجموعة ◄ وسائط

source: Permission to send messages. If disabled, the user won't be able to send any kind of message
ar: الصلاحيات لإرسال رسالة. عند تعطيلهاـ المستخدم لن يكون قادرا على إرسال رسائل

source: Permission to send media (audios, documents, photos, videos, video notes and voice notes). Implies the permission to send messages
ar: الصلاحيات لإرسال ملفات وسائط(صوتيات، مستندات، صور، فيديوهات، رسالة صوتية، رسالة مرئية). فعل الصلاحيات لإرسال الرسائل

source: Permission to send other types of messages (GIFs, games, stickers and use inline bots). Implies the permission to send medias
ar: الصلاحيات لإرسال أي نوع آخر من الرسائل (صور متحركة، ألعاب، ملصقات، بوتات). فعل الصلاحيات لإرسال الرسائل

source: When disabled, user's messages with a link won't show the web page preview
ar: عندما يتم تعطيلها، رسائل المستخدمين المصحوبة برابط لا يتم فيها عرض معاينة للرابط

source: Send messages
ar: إرسال رسائل

source: Send media
ar: إرسال وسائط

source: Send other types of media
ar: إرسال أي نوع آخر من الوسائط

source: Show web page preview
ar: عرض معاينة لصفحة الويب

source: You don't have the permission to restrict members
ar: ليس لديك الصلاحيات لتقييد الأعضاء

source: *Deafult permissions* From this menu you can change the default permissions that will be granted when a new member join. _Only the administrators with the permission to restrict a member can access this menu._ Tap on the name of a permission for a description of what kind of messages it will influence.
ar: *الصلاحيات الافتراضية* من هذه القائمة بإمكانك تغيير الصلاحيات الافتراضية التي تمنح عند دخول عضو جديد _فقط المشرفين الذين لديهم الصلاحية لتقييد عضو بإمكانهم الدخول لهذه القائمة_ اضغط على اسم الصلاحية لمعرفة ماهي الرسائل التي سوف تتأثر

source: Setting saved, but I can't edit the buttons because you are too fast! Wait other %d seconds
ar: تم حفظ الإعداد، ولكن لا يمكنني تعديل الأزرار لأنك سريع جدا! الرجاء الانتظار %d ثانية

source: This media has been saved as a response to %s
ar: تم حفظ ملف الوسائط هذا كإجابة لـ %s

source: Command '%s' saved!
ar: الأمر '%s' تم حفظه!

source: Commands deleted: `%s`
ar: الأوامر المحذوفة :`%s`

source: Commands not found: `%s`
ar: لم يتم إيجاد الأوامر :`%s`

source: _Please_ [start me](%s) _so I can send you the answer_
ar: _رجاء_ [فعلني](%s)_ لأستطيع ارسال الإجابة إليك_

source: ⚖ Current sensitivity. Tap on the + or the - to change it
ar: ⚖ الحساسية الحالية. اضغط على + أو - لتغييرها

source: Choose which media must be ignored by the antiflood (the bot won't consider them). ✅: ignored ❌: not ignored
ar: اختر أي نوع من الوسائط تريد من البوت تجاهلها في مكافح التكرار (البوت لن يهتم لها) ✅: تجاهل ❌:لا تتجاهل

source: 👞️ kick
ar: 👞️طرد

source: 🔨 ️ban
ar: 🔨 حظر

source: Flooders will be banned
ar: سيتم حظر مكرري الرسائل

source: Flooders will be kicked
ar: سيتم طرد مكرري الرسائل

source: Flooders will be muted
ar: سيتم كتم مكرري الرسائل

source: %d is not a valid value!
ar: %d قيمة غير صالحة

source: You can manage the antiflood settings from here. It is also possible to choose which type of messages the antiflood will ignore (✅)
ar: بإمكانك التحكم بإعدادات مكافحة التكرار من هنا. وبإمكانك أيضا اختيار أي نوع من الرسائل تريد أن يتجاهلها مكافح التكرار (✅)

source: Antiflood settings
ar: إعدادات مكافح التكرار

source: ❎ [%s] will be ignored by the anti-flood
ar: ❎ [%s] سيتم تجاهلها من قبل مكافح التكرار

source: 🚫 [%s] won't be ignored by the anti-flood
ar: 🚫 [%s] لن يتم تجاهلها بواسطة مكافح التكرار

source: Hello %s 👋🏼, nice to meet you! I'm Group Butler, the first administration bot using the official Bot API. *I can do a lot of cool stuffs*, here's a short list: • I can *kick or ban* users • You can use me to set the group rules • I have a flexible *anti-flood* system • I can *welcome new users* with a customizable message, or if you want with a gif or a sticker • I can *warn* users, and ban them when they reach the maximum number of warnings • I can also warn, kick or ban users when they post a specific media …and more, below you can find the "all commands" button to get the whole list! I work better if you add me to the group administrators (otherwise I won't be able to kick or ban)!
ar: أهلا %s 👋🏼، سعدت بلقائك! أنا Group Butler أول بوت إدارة يستخدم ال API الرسمي *بإمكاني إجراء بعض الأشياء الجيدة*، هذه قائمة قصيرة بما يمكن أن أفعل: •استطيع *طرد أو حظر* المستخدمين •استطيع أن أضبط قوانين للمجموعة •لدي نظام موسع لمكافحة التكرار •بإمكاني *الترحيب بالأعضاء الجدد* برسالة مخصصة، وإذا أردت بإمكانك استخدام صورة متحركة أو ملصق •بإمكاني *تنبيه* المستخدمين، وحظرهم عندما يتجاوزون الحد الأقصى من التنبيهات •بإمكاني أيضا التنبيه أو الطرد، أو الحظر عند إرسال وسائط معينة •...والكثير من الأشياء، بالأسفل بإمكانك إيجاد زر "all commands" لرؤية القائمة كاملة! أعمل بشكل أفضل عندما تضعني مشرفا على المجموعة، (وإلا لا أٍستطيع الطرد أو الحظر)!

source: This bot works only in supergroups. To work properly, [it needs to be admin in your group](https://telegram.me/GroupButler_ch/104), so it can kick or ban people if needed. Only the group owner can promote it :) You can use `/, ! or #` to trigger a command. Group Butler saves the adminlist of a group in its databse to avoid to send too many requests to Telegram. This list is updated every 5 hours, so there could be some differences between who the bot thinks are the admins and who the admins actually are, if during the 5 hours timeframe some users have been prmoted/demoted. It's possible to force the bot to update its adminlist with `/cache`. Remember: you have to use commands *in the group*, unless they are specifically designed for private chats (see "private" tab).
ar: هذا البوت يعمل فقط في المجموعات الخارقة لكي يعمل البوت بشكل صحيح [يجب أن يكون مشرفا في المجموعة](https://telegram.me/GroupButler_ch/104)، ليصبح بإمكانه طرد أو حظر الأشخاص عند الحاجة فقط منشئ المجموعة بإمكانه ترقية البوت تستطيع استخدام / أو ! أو # لتشغيل أمر البوت يحفظ قائمة المشرفين في قاعدة بياناته لتجنب إرسال طلبات كثيرة لخوادم تيليجرام هذه القائمة تتحدث كل 5 ساعات، من الممكن أن يكون هناك اختلاف بين قائمة المشرفين والمشرفين الحقيقيين، حيث أنه سيتم تحديث قائمة المشرفين والمسؤولين خلال 5 ساعات بإمكانك إجبار البوت لتحديث القائمة من خلال الأمر `/cache`. تذكر: يجب أن تستخدم الأوامر *في المجموعة*، إلا في حالة أن الأمر كان مصمما ليناسب المحادثة الخاصة (انظر زر "خاص/private"

source: In this menu you will find all the available commands
ar: في هذه القائمة ستجد جميع الأوامر المتاحة

source: *Commands that work in private*: • `/mysettings`: show a keyboard that allows you to change your personal settings, such as choosing if receive the rules in private when you join a group or if receive reports made with the `@admin` command • `/echo [text]` : the bot will send the text back, formatted with markdown • `/about` : show some useful informations about the bot • `/groups` : show the list of the discussion groups • `/id`: get your id • `/start` : show the initial message • `/help` : show this message
ar: *الأوامر التي تعمل في الخاص • `/mysettings`: يظهر لك لوحة التحكم التي تسمح لك بتغيير الإعدادات الشخصية، مثل اختيار استلام رسالة القوانين في الخاص عندما تدخل مجموعة، أو أيضا استلام التبليغات عند استخدام الأمر `@admin` • `/echo [text]` : البوت سيرسل لك النص مرة أخرى • `/about` : يظهر بعض المعلومات المهمة عن البوت • `/groups` : يعرض لك قائمة مجموعات الدعم • `/id`: اظهر عنوان ID الخاص بك • `/start` :عرض رسالة البوت • `/help` : عرض هذه الرسالة

source: *Commands available for every user in a group*: • `/dashboard`: see all the informations about the group • `/rules`: show the group rules • `/adminlist`: show the administrators of the group • `/help`: receive the help message • `!kickme`: the bot will kick you *Note*: `/dashboard`, `/adminlist`, `/modlist` and `/staff`replies always in private. If the bot is unable to reach an user, he will ask in the group to that user to be started, but just if _silent mode_ is off. With `/rules`, the bot always answer in the group for admins, but with normal users the message is sent in the group or in private according to the group settings. • `@admin` (by reply): report a message to the admins of the group (the bot will forward it in prvate). This ability could be turned off from the group settings. A description of the report can be added. Admins need to give their consense to receive reports from users, with `/mysettings` command
ar: *الأوامر المتاحة لجميع أعضاء المجموعة* • `/dashboard`: لرؤية جميع المعلومات المتعلقة بالمجموعة • `/rules`: عرض قوانين المجموعة • `/adminlist`: عرض قائمة مشرفي ومسؤولي المجموعة • `/help`: استلام رسالة المساعدة • `!kickme`: سيقوم البوت بطردك *ملاحظة*: الأوامر `/dashboard`, `/adminlist`, `/modlist` `/staff` سوف يرد عليها البوت في الخاص، إذا لم يستطع البوت الوصول إلى المستخدم، سوف يسأل المستخدم في المجموعة للبدء، فقط عندما يكون _الوضع الصامت_ مطفئ. الأمر `/rules` سوف يرد البوت في المجموعة إذا طلبه أحد المشرفين، ولكن إذا طلبه أحد الأعضاء فإنه سوف يرد عليه في الخاص وفقا لإعدادات المجموعة • `@admin` (بواسطة الرد): سوف يبلّغ البوت مشرفي المجموعة (البوت سيقوم بإعادة توجيهها إلى الخاص) هذه الخاصية من الممكن إيقافها من إعدادات المجموعة، وأيضا بإمكانك إضافة وصف لهذا الإبلاغ. المشرفين يجب أن يوافقوا على استلام البلاغات من المستخدمين باستخدام الأمر /mysettings

source: *Admins: info about the group* • `/setrules [group rules]`: set the new regulation for the group (the old will be overwritten). • `/setrules -`: delete the current rules. *Note*: the markdown is supported. If the text sent breaks the markdown, the bot will notify that something is wrong. For a correct use of the markdown, check [this post](https://telegram.me/GroupButler_ch/46) in the channel • `/setlink [link|-]`: set the group link, so it can be re-called by other admins, or unset it. If you are going to use it in a public supergroup, you do not need to append the group link. Just send `/setlink` • `/link`: get the group link, if already set. • `/msglink`: get the link to a message. Works only in public supergroups *Note*: the bot can recognize valid group links. If a link is not valid, you won't receive a reply.
ar: *المشرفين: معلومات عن المجموعة* • `/setrules [قوانين المجموعة]: اضبط قوانين المجموعة [سيتم حذف القوانين القديمة]. • `/setrules -`: سوف يحذف قوانين المجموعة الحالية. *ملاحظة*: markdown مدعومة. إذا كان النص الخاص بك لا يتوافق مع قواعد markdown، البوت سوف يشعرك بأن هناك خطأ ما. للاستخدام الصحيح لخاصية markdown انظر لهذه التدوينة في القناة (https://telegram.me/GroupButler_ch/46) • `/setlink [link|-]`: لتعيين رابط المجموعة، بإمكان المشرفين إعادة التسمية أو حذف الرابط. إذا تريد استخدام هذا الأمر في مجموعة خارقة عامة، لا يجب عليك كتابة الرابط فقط ارسل الأمر/setlink` • `/link`:احصل على رابط المجموعة، إذا تم تعيينه. • `/msglink`: احصل على الرابط من خلال رسالة. يعمل فقط في المجموعات الخارقة *ملاحظة*: البوت يمكنه فقط التعرف على الروابط الصحيحة. إذا كان الرابط غير صحيحا، لن تحصل على إجابة

source: *Banhammer powers* A set of commands that let admins kick and ban people from a group, and get some information about an user. Kicked people can join back, banned people can't. Banned users are added to the group's blacklist. It's possible to blacklist users even if they are not part of the group. Only the administrators who have the permission to restrict users can use these commands, but `/status` can be used by all the admins. • `/kick [by reply|username|id|text mention]`: kick a user from the group. • `/ban [by reply|username|id|text mention]`: ban a user from the group. • (*not working right now*) `/tempban [hours|nd nh]` = ban an user for a specific amount of hours (max: one week). For now, only by reply. Short form: `/tempban 1d 7h` • `/fwdban [by reply]`: ban the original sender of a forwarded message. • `/unban [by reply|username|id|text mention]`: unban the user from the group. • `/user [by reply|username|id|text mention]`: shows how many times the user has been banned *in all the groups*, and the warns received. • `/status [username|id]`: show the current status of the user `(member|kicked/left the chat|banned|admin/creator|never seen)`. A bot can't retrieve the status of an user if that user never started it before (in this case, the _never seen_ status is returned) *Antiflood* The "antiflood" is a system that auto-removes people that send many consecutive messages in a group. If on, the antiflood system will kick/ban flooders. • `/config` command, then `antiflood` button: manage the flood settings in private, with an inline keyboard. You can change the sensitivity, the action (kick/ban) to perform, and even set some exceptions.
ar: *مطرقة الحظر* عدة أوامر تساعد المشرفين في طرد أو حظر الأشخاص من المجموعة، والحصول على بعض المعلومات المتعلقة بأحد المستخدمين. الأعضاء المطرودين يمكنهم العودة مرة أخرى لكن الأعضاء المحظورين لا يمكنهم ذلك، المستخدمين المحظورين يتم إضافته لقائمة المجموعة السوداء. بإمكانك أيضا إضافة أشخاص ليسوا أعضاء للقائمة السوداء فقط المشرفين الذين لديهم الصلاحيات لتقييد الأعضاء بإمكانهم استخدام هذه الأوامر ماعدا الأمر `/status` بإمكان أي مشرف استخدامه. • `/kick [بواسطة الرد |اسم المستخدم|عنوان ID|نداء]`: لطرد مستخدم من المجموعة • `/ban [بواسطة الرد |اسم المستخدم|عنوان ID|نداء]`: لحظر مستخدم من المجموعة • `/tempban = لحظر مستخدم لعدد معين من الساعات (أقصى مدة : أسبوع). حاليا يعمل الأمر بواسطة الرد. مثال: `/tempban 1d 7h بمعنى حظر مؤقت لمدة يوم و7 ساعات • `/fwdban [بواسطة الرد]`: حظر مرسل الرسالة الأصلي للرسائل المعاد توجيهها. • `/unban [بواسطة الرد |اسم المستخدم|عنوان ID|نداء]`: رفع حظر العضو من المجموعة • `/user [بواسطة الرد |اسم المستخدم|عنوان ID|نداء]`: لعرض عدد مرات حظر المستخدم *في جميع المجموعات*، وعدد التنبيهات التي تلقاها • `/status [اسم المستخدم|عنوان ID]`: لعرض حالة العضو الحالية `(عضو|مطرود/غادر|محظور|مشرف/منشئ|لم يتم رؤيته من قبل) إذا لم يستطع البوت رؤية حالة المستخدم أو أنه لم يبدأ بالفعل (في هذه الحالة سوف تظهر حالة _لم يتم رؤيته من قبل) *مكافح التكرار* نظام مكافحة التكرار سيزيل تلقائيا الأشخاص الذين يرسلون الرسائل بشكل مكرر في المجموعة. عندما يكون مشغلا، النظام سوف يحظر/يطرد المكررين. • `/config` اكتب هذا الأمر ثم اضغط على زر مكافح الإزعاج: لتغيير إعدادات الإزعاج على الخاص، باستخدام لوحة تحكم صغيرة. بإمكانك تغيير الحساسية، أو تغيير الإجراء (طرد/حظر)، وأيضا وضع بعض الاستثناءات.

source: *Reports settings* `@admin` is an useful command to let users report some messages to the group admins. A reported message will be forwarded to the available admins. • `/config` command, then `menu` button: here you can find a voice, "Report". If turned on, users will be able to use `@admin` command. Only admins who accepted to receive reports (with `/mysettings` command) will be notified • `/mysettings` (in private): from here, you can choose if receive reports or not *Note*: admins can't use the `@admin` command, and users can't report admins with it.
ar: *إعدادات البلاغات* `@admin` هو أمر مفيد لجعل الأعضاء يبلغون بعض الرسائل لتصل للمشرفين. الرسالة المبلغ عنها سيتم إرسالها للمشرفين المتاحين • اذهب للأمر `/config` ثم زر "القائمة الرئيسية": بإمكانك إيجاد "البلاغات" عندما تكون مفعلة، بإمكان الأعضاء استخدام الأمر @admin. فقط المشرفين الذين يقبلون استلام البلاغات من خلال الأمر `/mysettings` سيتم إشعارهم • `/mysettings` (يعمل في الخاص) : من هنا، بإمكانك اختيار ما إذا أردت استلام البلاغات أو لا *ملاحظة*: المشرفين لا يمكنهم استعمال الأمر `@admin`، فقط الأعضاء بإمكانهم استخدامه.
